


Audio Video Transport                                           A. Leung
Internet-Draft                                                S. Futemma
Intended status: Standards Track                              E. Itakura
Expires: March 9, 2008                                              Sony
                                                             Sep 6, 2007


Payload Format for JPEG 2000 Video: Extensions for Scalability and Main
                            Header Recovery
                  draft-ietf-avt-rtp-jpeg2000-beam-08

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on March 9, 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2007).












Leung, et al.             Expires March 9, 2008                 [Page 1]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


Abstract

   This memo describes extended uses for payload header in RFC document:
   "RTP Payload Format for JPEG 2000 Video Streams."  For better support
   of JPEG 2000 features such as scalability and includes a main header
   recovery method.

   This memo must be accompanied with a complete implementation of "RTP
   Payload Format for JPEG 2000 Video Streams."  That document is a
   complete description of the payload header and signaling, this
   document only describes additional processing for the payload header.
   There is an additional media type and SDP marker signaling for
   implementations of this document.






































Leung, et al.             Expires March 9, 2008                 [Page 2]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.1.  History  . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.2.  Description of the Mechanisms  . . . . . . . . . . . . . .  4
       1.2.1.  Main Header Compensation . . . . . . . . . . . . . . .  4
       1.2.2.  Priority Table . . . . . . . . . . . . . . . . . . . .  4
     1.3.  Motivations for Priority Field coding  . . . . . . . . . .  5
       1.3.1.  Scenario: Just enough resolution . . . . . . . . . . .  5
       1.3.2.  Scenario: Multiple clients, single source  . . . . . .  5
     1.4.  Conventions Used in This Document  . . . . . . . . . . . .  6
   2.  Payload Format Enhanced Processing . . . . . . . . . . . . . .  7
     2.1.  Enhanced Processing Markers  . . . . . . . . . . . . . . .  7
   3.  Priority Mapping Table . . . . . . . . . . . . . . . . . . . .  9
     3.1.  Packet Number Based Ordering . . . . . . . . . . . . . . .  9
     3.2.  Progression Based Ordering . . . . . . . . . . . . . . . .  9
     3.3.  Layer Based Ordering . . . . . . . . . . . . . . . . . . . 10
     3.4.  Resolution Based Ordering  . . . . . . . . . . . . . . . . 10
     3.5.  Component Based Ordering . . . . . . . . . . . . . . . . . 11
   4.  JPEG 2000 Main Header Compensation Scheme  . . . . . . . . . . 12
     4.1.  Sender Processing  . . . . . . . . . . . . . . . . . . . . 12
     4.2.  Receiver Processing  . . . . . . . . . . . . . . . . . . . 12
   5.  Security Consideration . . . . . . . . . . . . . . . . . . . . 14
   6.  Congestion Control . . . . . . . . . . . . . . . . . . . . . . 15
   7.  IANA Consideration . . . . . . . . . . . . . . . . . . . . . . 16
     7.1.  Media Type Registration  . . . . . . . . . . . . . . . . . 16
     7.2.  SDP Parameters . . . . . . . . . . . . . . . . . . . . . . 19
   8.  Usage with the SDP Offer/Answer Model  . . . . . . . . . . . . 21
     8.1.  Examples . . . . . . . . . . . . . . . . . . . . . . . . . 21
       8.1.1.  Example 1  . . . . . . . . . . . . . . . . . . . . . . 21
       8.1.2.  Example 2  . . . . . . . . . . . . . . . . . . . . . . 22
       8.1.3.  Example 3  . . . . . . . . . . . . . . . . . . . . . . 23
   9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 24
     9.1.  Normative References . . . . . . . . . . . . . . . . . . . 24
     9.2.  Informative References . . . . . . . . . . . . . . . . . . 24
   Appendix A.  Sample Headers in Detail  . . . . . . . . . . . . . . 25
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 33
   Intellectual Property and Copyright Statements . . . . . . . . . . 34













Leung, et al.             Expires March 9, 2008                 [Page 3]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


1.  Introduction

   This document is an extension of: "RTP Payload Format for JPEG 2000
   Video Streams" [1].  These are additional mechanisms that can be used
   with certain parts of the header in [1] to support JPEG 2000 features
   such as scalability and a main header compensation method.  These
   mechanisms are described in detail in this document.

1.1.  History

   In the development of RFC XXXY [1], there was an issue of IPR claims
   on certain mechanisms with main header compensation, priority table
   usage, etc. in RFC XXXY [1].  As these are not "essential" to the
   core RTP format of RFC XXXY [1] and only describes a mechanism, it
   was decided that splitting these mechanisms from the core JPEG 2000
   RTP format in to a separate document.  This is the document
   describing the IPR related mechanisms for main header recover and
   priority table usage.

1.2.  Description of the Mechanisms

1.2.1.  Main Header Compensation

   JPEG 2000's scalable coding scheme allows for decompressing truncated
   or partial data streams but only when the main header is present.  If
   the header is lost, the data is useless.  With JPEG 2000 video
   coding, coding parameters between frames will rarely change and
   previous headers may be used in newly received data which the header
   have been lost.

   Compensation of the main header that has been lost is very simple
   with this procedure.  In the case of JPEG 2000 video, it is very
   common that encode parameters will not vary greatly between
   successive frames.  Even if the RTP packet including the main header
   of a frame has been dropped, decoding may be performed by using the
   main header of a prior frame.

1.2.2.  Priority Table

   JPEG 2000 codestream has rich functionality built into it so decoders
   can easily handle scalable delivery or progressive transmission.
   Progressive transmission allows images to be reconstructed with
   increasing pixel accuracy or spatial resolution.  This feature allows
   the reconstruction of images with different resolutions and pixel
   accuracy, for different target devices.  A single image source can
   provide a codestream that is easily processed for smaller image
   display devices.




Leung, et al.             Expires March 9, 2008                 [Page 4]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   JPEG 2000 packets contain all compressed image data from a specific:
   layer, component, resolution level, and/or precinct.  The order in
   which these JPEG 2000 packets are found in the codestream is called:
   progression order.  The ordering of the JPEG 2000 packets can
   progress along four axes: layer, component, resolution and precinct
   (or position).

   Providing a priority field to indicate the importance of data
   contained in a given RTP packet can aid in usage of JPEG 2000
   progressive and scalable functions.

1.3.  Motivations for Priority Field coding

   JPEG 2000 coding scheme allows one to reorder the codestream in many
   ways.  Even when the coding scheme is determined and arranged by the
   encoder, a decoder can still re-arrange the code stream on the fly to
   suit decode parameters such as: re-arranging from resolution
   progressive to quality progressive.

   Using the priority field coding, the decoder gains insight into the
   codestream without access to the full codestream and exposes features
   of JPEG 2000 to a higher level.

   A few of the scenarios are presented below the authors have thought
   of to utilize this field.  The priority field allows more information
   about the image to be sent without more signaling between sender and
   receivers to leverage JPEG 2000 capabilities.

1.3.1.  Scenario: Just enough resolution

   The scenario is when rapid scene access is more important than higher
   quality.  By using the priority field, the receiver can decode for
   its own quality level.  If the sender cannot determine the receiver's
   resolution, the receiver can select which parts of the codestream to
   decode/load by using the priority field.

1.3.2.  Scenario: Multiple clients, single source

   In a multicast environment, there are clients with better visual
   capability than others (i.e.  TV conference vs. Mobile).  The
   respective clients can use the priority field to determine which
   packets are vital for their own visual presentation.  The sender will
   have to do work on the priority field to optimally serve all the
   clients while only managing a single visual stream.







Leung, et al.             Expires March 9, 2008                 [Page 5]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


1.4.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC2119. [2].

   RFC-Editor Note: The RFC Editor is requested to replace all
   occurences of RFC XXXY with the RFC number
   draft-ietf-avt-rtp-jpeg2000 receives.  At that time, please remove
   this note.









































Leung, et al.             Expires March 9, 2008                 [Page 6]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


2.  Payload Format Enhanced Processing

2.1.  Enhanced Processing Markers

   This section of the document describes additional usage in the values
   of mh_id and priority fields and interpretation which differ from RFC
   XXXY [1].  Implementions of this document should follow RFC XXXY [1]
   first then add additional header processing as described in this
   document.  Implementations following this document are expected to
   interoperate with implementations of [1] and this document as well.

   The RTP payload header format for JPEG 2000 video stream is as
   follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |tp |MHF|mh_id|T|     priority  |           tile number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |reserved       |             fragment offset                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




             Figure 1: RTP payload header format for JPEG 2000

   mh_id (Main Header Identification) : 3 bits

      Main header identification value.  This is used for JPEG 2000 main
      header recovery.

      The initial value of mh_id is random, and may take any value
      between 1-7, but MUST NOT be 0.

      The same mh_id value is used as long as the coding parameters
      described in the main header remains unchanged between frames.

      The mh_id value MUST be incremented by 1 every time a new main
      header is transmitted.  Once the mh_id value becomes greater than
      7, it SHOULD roll over to 1.

      When mh_id is 0, it has special usage for the receiver.  This
      special usage is described in Section 4.2 of this document.

      Senders should follow Section 4.1 of this document for proper
      mh_id assignment and usage.




Leung, et al.             Expires March 9, 2008                 [Page 7]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   priority : 8 bits

      The priority field indicates the importance of the JPEG 2000
      packet included in the payload.  Typically, a higher priority is
      set in the packets containing JPEG 2000 packets containing the
      lower sub-bands.

      Special values of priority:

      0: This is reserved for payload which contain a header (main or
         tile part header.)  This is considered the most important.

      1 to 255:  These values decrease in importance as the values
         increase. (i.e. 1 is more important than 2, etc.)  Applying
         priority values should correlate directly to JPEG 2000
         codestream in importance.

      The lower the priority value is the higher the importance.  A
      priority value of 0 is the highest importance and 255 is the
      lowest importance.  We define the priority value 0 as a special
      priority value for the headers (the main header or tile-part
      header).  If any headers (the main header or tile-part header) are
      packed into the RTP payload, the sender MUST set the priority
      value to 0.

      Assignment of the values are described in Section 3

























Leung, et al.             Expires March 9, 2008                 [Page 8]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


3.  Priority Mapping Table

   For the progression order, the priority value for each JPEG 2000
   packet is given by the priority mapping table.

   This document specify several commonly-used priority mapping tables,
   pre-defined priority mapping tables: packet number based (default),
   progression-based, layer-based, resolution-based, position-based, and
   component-based.

   Packet number priority mapping is REQUIRED to be supported by clients
   implementing this specification.  Other priority mapping tables
   (progression, layer, resolution, and component based) are OPTIONAL to
   implementations of this specification.

   Rules that all implementations of this specification MUST follow in
   all priority modes:

   o  When there is a header in the packet with a JPEG 2000 packet, the
      sender MUST set the payload packet priority value to 0.

   o  When there are multiple JPEG 2000 packets in the same RTP payload
      packet, the sender MUST set the payload packet priority value to
      the lowest JPEG 2000 packet. (i.e. if JPEG 2000 packets with
      priority: 5,6,7 are packed into a single payload, the priority
      value will be 5.)

3.1.  Packet Number Based Ordering

   Packet number based ordering assigns the payload packet priority
   value from the "JPEG 2000 packet value". (note: JPEG 2000 codestreams
   are stored in units of packets and each packet has a value .)  This
   method is the default method for assigning priority value.  All
   implementations of this specification MUST support this method.

   If the JPEG 2000 codestream packet value is greater than 255, the
   sender MUST set the payload priority value to 255.

3.2.  Progression Based Ordering

   The sender will assign the payload packet priority value only based
   on layer, resolution, and component ordering of the codestream.

   This is similar to the packet number based assignment but will not
   take into account the precinct number or position in the JPEG 2000
   codestream.

   For example:



Leung, et al.             Expires March 9, 2008                 [Page 9]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   If the codestream is ordered in LRCP (Layer, Resolution, Component,
   Position)

      All the packets in:

         layer.........0
         resolution....0
         component.....0

      then the packet priority value : 1

      All the packets in:

         layer.........0
         resolution....0
         component.....1

      then the packet priority value : 2

      All the packets in:

         layer.........0
         resolution....0
         component.....2

      then the packet priority value : 3

3.3.  Layer Based Ordering

   Layer-based priority mapping table simplifies the default mapping to
   just matching JPEG 2000 packets together from the same layer.

   For example:

      All the packets in layer 0 : packet priority value : 1
      All the packets in layer 1 : packet priority value : 2
      All the packets in layer 2 : packet priority value : 3
      ...
      All the packets in layer n : packet priority value : n+1
      All the packets in layer 255 : packet priority value : 255

3.4.  Resolution Based Ordering

   Resolution-based priority mapping table is similar to the layer based
   order but for JPEG 2000 packets of the same resolution

   For example:




Leung, et al.             Expires March 9, 2008                [Page 10]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


      All the packets in resolution 0 : packet priority value : 1
      All the packets in resolution 1 : packet priority value : 2
      All the packets in resolution 2 : packet priority value : 3
      ...
      All the packets in resolution n : packet priority value : n+1
      All the packets in resolution 255 : packet priority value : 255

3.5.  Component Based Ordering

   Component-based priority mapping table is mapping together JPEG 2000
   components of the same component

   For example:

      All the packets in component 0 : packet priority value : 1
      All the packets in component 1 : packet priority value : 2
      All the packets in component 2 : packet priority value : 3
      ...
      All the packets in component n : packet priority value : n+1
      All the packets in component 255 : packet priority value : 255































Leung, et al.             Expires March 9, 2008                [Page 11]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


4.  JPEG 2000 Main Header Compensation Scheme

   The mh_id field of the payload header is used to indicate whether the
   encoding parameters of the main header are the same as the encoding
   parameters of the previous frame.  The same value is set in mh_id of
   the RTP packet in the same frame.  The mh_id and encode parameters
   are not associated with each other as 1:1 but they are used to
   indicate whether the encode parameters of the previous frame are the
   same or not in the event of a lost header.

   The mh_id field value SHOULD be saved from previous frames to be used
   to recover the current frame's main header.  If the mh_id of the
   current frame has the same value as the mh_id value of the previous
   frame, the previous frame's main header MAY be used to decode the
   current frame, in case of a lost header in the current frame.

   The sender MUST increment mh_id when parameters in the header change
   and send a new main header accordingly.

   The receiver MAY use the mh_id and MAY retain the header for such
   compensation.

4.1.  Sender Processing

   The sender MUST transmit RTP packets with the same mh_id value if the
   encoder parameters of the current frame are the same as the previous
   frame.  The encoding parameters are the fixed information marker
   segment (SIZ marker) and functional marker segments (COD, COC, RGN,
   QCD, QCC, and POC) specified in JPEG 2000 Part 1 Annex A [3].

   An initial value of mh_id MUST be selected randomly between 1 and 7
   for security reasons.

   If the encode parameters changes, the sender transmitting RTP packets
   MUST increment the mh_id value by one, but when mh_id value becomes
   greater than 7, a sender MUST set mh_id value back to 1.

4.2.  Receiver Processing

   When the receiver receives the main header completely, the RTP
   sequence number, the mh_id and main header should be saved.  Only the
   last main header that was received completely SHOULD be saved.  When
   the mh_id value is 0, the receiver SHOULD NOT save the header.

   When the main header is not received, the receiver may compare the
   current payload header's mh_id value with the previous saved mh_id
   value.  If the values match, decoding may be performed by using the
   previously saved main header.



Leung, et al.             Expires March 9, 2008                [Page 12]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   If the mh_id field is set to 0, the receiver MUST NOT save the main
   header and MUST NOT compensate for lost headers.

   If the mh_id value changes, receivers SHOULD save the current header
   and save the new mh_id value.  The old saved header should be deleted
   from storage.













































Leung, et al.             Expires March 9, 2008                [Page 13]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


5.  Security Consideration

   Please refer to section 6 of RFC XXXY [1] for Security Considerations
   regarding this RTP format.















































Leung, et al.             Expires March 9, 2008                [Page 14]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


6.  Congestion Control

   Please refer to section 7 of RFC XXXY [1] for Congestion Control
   regarding this RTP format.















































Leung, et al.             Expires March 9, 2008                [Page 15]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


7.  IANA Consideration

7.1.  Media Type Registration

   This document extends the associated media type from RFC XXXY[1]:
   Here is the complete original for reference.

   This registration uses the template defined in [7] and follows [8].

   Type name: video

   Subtype name: jpeg2000

   Required parameters:

      rate:  The RTP timestamp clock rate.  The default rate is 90000,
         but other rates MAY be specified.  Rates below 1000 Hz SHOULD
         NOT be used.

      sampling:  A list of values specifying the color space of the
         payload data.

         Acceptable values:

            RGB:  standard Red, Green, Blue color space.

            BGR:  standard Blue, Green, Red color space.

            RGBA:  standard Red, Green, Blue, Alpha color space.

            BGRA:  standard Blue, Green, Red, Alpha color space.

            YCbCr-4:4:4:  standard YCbCr color space, no subsampling.

            YCbCr-4:2:2:  standard YCbCr color space, Cb and Cr are
               subsampled horizontally by 1/2.

            YCbCr-4:2:0:  standard YCbCr color space, Cb and Cr are
               subsampled horizontally and vertically by 1/2.

            YCbCr-4:1:1:  standard YCbCr color space, Cb and Cr are
               subsampled vertically by 1/4

            GRAYSCALE:  basically a single component image of just
               multilevels of grey.






Leung, et al.             Expires March 9, 2008                [Page 16]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


            EXTENSION VALUE:  Additional color samplings can be
               registered with and current listing of registered color
               samplings at: Color Sampling Registration Authority.
               Please refer to RTP Format for Uncompressed Video. [9]

   Optional parameters:

      interlace:  interlace scanning.  If payload is in interlace
         format, the acceptable value is "1", otherwise, the value
         should be "0".  Each complete image forms vertically half the
         display. tp value MUST properly specify the field the image
         represents odd(tp=1), or even(tp=2).  If this option is not
         present, the payload MUST be in progressive format and tp MUST
         be set to 0.

      width:  A parameter describing the maximum width of the video
         stream.  This parameter MUST appear when height is present.
         Acceptable values: - an integer value between 0 -
         4,294,967,295.

      height:  A parameter describing the maximum height of the video
         stream.  This parameter MUST appear when width is present.
         Acceptable values: - an integer value between 0 -
         4,294,967,295.

   The receiver MUST ignore any unspecified parameters outside of this
   list and in [1] .

   Additional parameters for this extension:

      mhc  : Main Header Compensation. this option is used when sender
         and/or receiver is utilizing the Main Header compensation
         technique as specified in this document.  Acceptable values
         when using the Main Header compensation technique is "1",
         otherwise, it should be "0".

         This is a list of options to be included when the sender or
         receiver is utilizing the Priority Table(s) as specified in
         this document.

      pt : Priority Table. this option is followed by a comma-separated
         list of predefined priority table definitions to be used by
         sender or receiver.

         The option appearing front most in the option line is the most
         important and next ones are of decreasing importance.





Leung, et al.             Expires March 9, 2008                [Page 17]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


            Acceptable values:

            progression  : this table follows the progression ordering
               of the codestream.

            layer  : this table follows the layer ordering of the
               codestream.

            resolution  : this table follows the resolution ordering of
               the codestream.

            component  : this table follows the component ordering of
               the codestream.

            default  : this table follows the ordering of the
               codestream.

   Encoding considerations:

      This media type is framed and binary, see Section 4.8 in [7]

   Security considerations:

      see security considerations section Section 5 of this document.

   Interoperability considerations:

      JPEG 2000 video stream is a sequence of JPEG 2000 still images.
      An implementation in compliant with [3] can decode and attempt to
      display the encoded JPEG 2000 video stream.

   Published specification: ISO/IEC 15444-1 | ITU-T Rec. T.800

   Applications which use this media type:

      video streaming and communication

   Person and email address to contact for further information:

      Eisaburo Itakura, Satoshi Futemma, Andrew Leung
      Email: {itakura|satosi-f} @ sm . sony . co . jp, andrew @ ualberta
      . net

   Intended usage: Restriction

      Restrictions on Usage:





Leung, et al.             Expires March 9, 2008                [Page 18]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


         This media type depends on RTP framing, and hence is only
         defined for the transfer via RTP [4].  Transport within other
         framing protocols is not defined at the time.

   Author/Change Controller:

      Author:

         Eisaburo Itakura, Satoshi Futemma, Andrew Leung
         Email: {itakura|satosi-f} @ sm . sony . co . jp, andrew @
         ualberta . net

      Change controller:

         IETF Audio/Video Transport Working Group delegated from the
         IESG

7.2.  SDP Parameters

   In addition to SDP Parameters section in [1]:

   The media type video/jpeg2000 string is mapped to fields in the
   Session Description Protocol (SDP) [5] as follows:

   o  The media name in the "m=" line of SDP MUST be video.

   o  The encoding name in the "a=rtpmap" line of SDP MUST be jpeg2000
      (the MIME subtype).

   o  The clock rate in the "a=rtpmap" line is set according to the
      "rate" parameter.  Senders that wish to use a non-90kHz rate
      SHOULD also offer the same stream using a 90kHz timestamp rate
      with a different RTP payload type allowing graceful fallback to
      90kHz for compatibility.

   o  The OPTIONAL parameters "mhc" or "pt" MUST be included in the
      "a=fmtp" line of SDP.

   These parameters are expressed as a media type string, in the form of
   a semicolon separated list of parameter=value pairs.

   Therefore, an example of media representation in SDP is as follows:

      m=video 49170/2 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 rate=90000;mhc=1;pt=default; sampling=YCbCr-4:2:0;
      width=128; height=128




Leung, et al.             Expires March 9, 2008                [Page 19]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   An example for using non-90kHz timestamp is as follows:

      m=video 49170/2 RTP/AVP 98 99
      a=rtpmap:98 jpeg2000/27000000
      a=rtpmap:99 jpeg2000/90000
      a=fmtp:98 rate=27000000;mhc=1;pt=default; sampling=YCbCr-4:2:0;
      width=128; height=128
      a=fmtp:99 rate=90000;mhc=1;pt=default; sampling=YCbCr-4:2:0;
      width=128; height=128










































Leung, et al.             Expires March 9, 2008                [Page 20]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


8.  Usage with the SDP Offer/Answer Model

   In addition to SDP Offer/Answer section in RFC XXXY [1]:

   When offering JPEG 2000 over RTP using SDP in an Offer/Answer model
   [6], the following rules and limitations apply:

   o  All parameters MUST have an acceptable value for that parameter.

   o  All parameters MUST correspond to the parameters of the payload.

   o  The parameters "mhc" or "pt" MUST appear in the offer and answer.
      If the parameter "mhc" or "pt" is not in the answer, senders
      should not process the header according to this document.

   o  For the "pt" option:

      *  Senders should send a complete list indicating which option are
         available to the receiver.  The receiver should answer with
         their preference from the offer list.

   o  In a multicast environment:

      *  Senders should send out one option for priority-table-
         definition for everyone in the group.

      *  If a single client in the group do not support the extensions
         outlined in this document, senders SHOULD NOT use additional
         techniques outlined in this document.

      This is highly recommended for multicast streams where not all
      receivers are of the same type.

8.1.  Examples

   Offer/Answer example exchanges are provided.

8.1.1.  Example 1

   Alice offers Main Header Compensation functionality, YCbCr 422 color
   space, interlace image with 720-pixel width and 480-pixel height and
   several priority-table options (default, progression, layer,
   resolution, component) as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.example
      s=
      c=IN IP4 host.example



Leung, et al.             Expires March 9, 2008                [Page 21]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


      t=0 0
      m=video 49170 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 rate=90000;mhc=1; sampling=YCbCr-4:2:2; interlace=1;
      pt=default,progression,layer,resolution, component;
      width=720;height=480

   Bob accepts Main Header Compensation functionality, YCbCr-4:2:2 color
   space, interlace image, default mapping table and replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 rate=90000;mhc=1; sampling=YCbCr-4:2:2;interlace=1;
      pt=default;width=720;height=480

8.1.2.  Example 2

   Alice offers Main Header Compensation, YCbCr 420 color space,
   progressive image with 320-pixel width and 240-pixel height and layer
   priority-table options as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49170 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 rate=90000;mhc=1; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240

   Bob does not accept Main Header Compensation functionality but
   accepts YCbCr-4:2:0 color space,layer based priority mapping and
   replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 rate=90000;mhc=0; sampling=YCbCr-4:2:0;



Leung, et al.             Expires March 9, 2008                [Page 22]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


      pt=layer;width=320;height=240

8.1.3.  Example 3

   Alice offers 27 MHz timestamp, Main Header Compensation, YCbCr 420
   color space, progressive image with 320-pixel width and 240-pixel
   height and layer priority-table options as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49170 RTP/AVP 98 99
      a=rtpmap:98 jpeg2000/27000000
      a=rtpmap:99 jpeg2000/90000
      a=fmtp:98 rate=27000000;mhc=1; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240
      a=fmtp:99 rate=90000;mhc=1; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240

   Bob can accept payload type with 27 MHz timestamp, and does not
   accept Main Header Compensation functionality but accepts YCbCr-4:2:0
   color space,layer based priority mapping and replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/27000000
      a=fmtp:98 rate=27000000;mhc=0; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240

















Leung, et al.             Expires March 9, 2008                [Page 23]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


9.  References

9.1.  Normative References

   [1]  Futemma, "RTP Payload Format for JPEG 2000 Video Streams",
        RFC XXXY, April 2007.

   [2]  Bradner, "Key words for use in RFCs to Indicate Requirement
        Levels", RFC 2119, March 1997.

   [3]  ISO/IEC JTC1/SC29, ISO/IEC 15444-1 | ITU-T Rec. T.800,
        "Information Technology - JPEG 2000 Image Coding System -  Part
        1: Core Coding System", December 2000.

   [4]  Schulzrinne, Casner, Frederick, and Jacobson, "RTP: A Transport
        Protocol for Real Time Applications", RFC 3550, STD 64,
        July 2003.

   [5]  Handley and Jacobson, "SDP: Session Description Protocol",
        RFC 4566, July 2006.

   [6]  Rosenberg and Schulzrinne, "An Offer/Answer Model with Session
        Description Protocol (SDP)", RFC 3264, June 2002.

   [7]  Freed and Klensin, "Media Type Specifications and Registration
        Procedures", RFC 4288, December 2005.

   [8]  Casner, "Media Type Registration of RTP Payload Formats",
        RFC 4855, February 2007.

9.2.  Informative References

   [9]  Perkins and Gharai, "RTP Payload Format for Uncompressed Video",
        RFC 4175, September 2005.

















Leung, et al.             Expires March 9, 2008                [Page 24]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


Appendix A.  Sample Headers in Detail

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |tp |MHF|mh_id|T|     priority  |           tile number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |reserved       |             fragment offset                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 2

   First Packet: This packet will have the whole main header. 210 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 1|1 0 1|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 3

   Second Packet: This packet will have a tile header and the first tile
   part LLband 1500 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 1|1 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 2DB3  0001 FF93                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 4








Leung, et al.             Expires March 9, 2008                [Page 25]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   Third Packet: This packet will have the next part in the tile, no
   tile header 1500 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|1 0 1|0|0 0 0 0 0 0 1 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 1 0 1 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |E841 4526 4556 9850 C2EA  ....                                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 5

   Fourth Packet: Last packet for the image 290 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|1 0 1|0|0 0 0 0 0 0 1 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |A55D 8B73 3B25 25C7 B9EB        ....                   2FBEB153|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 6

   First Packet: This packet will have the whole main header. 210 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 1|0 0 1|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 7






Leung, et al.             Expires March 9, 2008                [Page 26]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   Second Packet: This packet will have a first tile part (tile 0) 1400
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 8

   Third Packet: This packet will have a second tile part (tile 1) 1423
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0001 0000 058F 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 9

   Fourth Packet: This packet will have a third tile part (tile 2) 1355
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 1 1 0 0 1|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0002 0000 054B 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 10




Leung, et al.             Expires March 9, 2008                [Page 27]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   Fifth Packet: This packet will have a fourth tile part (tile 3) 1290
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 1 0 0 1 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0003 0000 050A 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 11

   First Packet: This packet will have the first part of the main
   header. 110 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 1|0 0 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 12

   Second Packet: This packet has the second part of the header. 1400
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 0|0 0 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF6400FF ....                                                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 13




Leung, et al.             Expires March 9, 2008                [Page 28]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   Third Packet: This packet has two tiles, tile 0 and tile 1 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 0 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 02BC 0001 FF93  ...                        |
   |FF90 000A 0001 0000 02BC 0001 FF93 ...                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 14

   Fourth Packet: This packet has one tile, tile 2 1395 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 0|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 0 1 0 1 1 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0002 0000 0573 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 15

   First packet: This packet will have the whole main header for the odd
   field 210 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|1 1|0 1 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 16





Leung, et al.             Expires March 9, 2008                [Page 29]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   Second packet: This packet will have the first part of the odd
   field's tile 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|0 0|0 1 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 17

   Third packet: This packet will have the second part of the odd
   field's tile 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |7F04 E708 27D9 D11D 22CB ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 18

   Fourth packet: This packet will have the third part of the odd
   field's tile 1300 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |98BD EC9B 2826 DC62 D4AB ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 19




Leung, et al.             Expires March 9, 2008                [Page 30]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   Fifth packet: This packet will have the whole main header for the
   even field

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|1 1|0 1 1|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 20

   Sixth packet: This packet will have the first part of the odd field's
   tile 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|0 0|0 1 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 21

   Seventh packet: This packet will have the second part of the odd
   field's tile 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |626C 42F0 166B 6BD0 F8E1 ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 22




Leung, et al.             Expires March 9, 2008                [Page 31]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


   Eighth packet: This packet will have the third part of the odd
   field's tile 1300 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |8114 41D5 18AB 4A1B ...                                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 23




































Leung, et al.             Expires March 9, 2008                [Page 32]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


Authors' Addresses

   Andrew Leung
   Sony Corporation
   1-7-1 Konan
   Minato-ku
   Tokyo  108-0075
   Japan

   Phone: +81 3 6748-2111
   Email: andrew @ ualberta . net
   URI:   http://www.sony.net/


   Satoshi Futemma
   Sony Corporation
   1-7-1 Konan
   Minato-ku
   Tokyo  108-0075
   Japan

   Phone: +81 3 6748-2111
   Email: satosi-f @ sm . sony . co . jp
   URI:   http://www.sony.net/


   Eisaburo Itakura
   Sony Corporation
   1-7-1 Konan
   Minato-ku
   Tokyo  108-0075
   Japan

   Phone: +81 3 6748-2111
   Email: itakura @ sm . sony . co . jp
   URI:   http://www.sony.net/















Leung, et al.             Expires March 9, 2008                [Page 33]

Internet-Draft              JPEG 2000 RTP EX                    Sep 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Leung, et al.             Expires March 9, 2008                [Page 34]

